app/controllers/kitas_controller.rb

  def show
    @kita = Kita.find(params[:id])
---
SELECT * FROM `kitas` WHERE (`kitas`.`id` = 2041)